// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29
//
using static MyLibrary;
//
//
int m=2;
int n=3;

Console.WriteLine(">>>>>------>>>>>" + '\n');
Console.WriteLine("Значение функции Аккермана от m=" + $"{m}" + " и n=" +  $"{n}" + " равно:" + $"{Akm(m,n)}" +".");
m = 3; n=2;
Console.WriteLine("Значение функции Аккермана от m=" + $"{m}" + " и n=" +  $"{n}" + " равно:" + $"{Akm(m,n)}" +".");


string[] stringArray = { "Х", "О", "Р", "О", "Ш", "Е", "Г", "О", " ", "Д", "Н", "Я", "!", "0" };

HappyNewYear(stringArray);  //   вывод на консоль приветственного сообщения.
